[{"date":1602850538000,"favorites":88181,"id":"1317076736555819008","isRetweet":false,"retweets":22669,"text":"Steve Scully of @cspan had a very bad week. When his name was announced, I said he would not be appropriate because of conflicts. I was right! Then he said he was hacked, he wasn’t. I was right again! But his biggest mistake was “confiding” in a lowlife loser like the Mooch. Sad!"},{"date":1602626201000,"favorites":108669,"id":"1316135797502996481","isRetweet":false,"retweets":26666,"text":"How dare failed Presidential Candidate (1% and falling!) @CoryBooker make false charges and statements about me in addressing Judge Barrett. Illegally, never even lived in Newark when he was Mayor. Guy is a total loser! I want better Healthcare for far less money, always....."},{"date":1602355139000,"favorites":218458,"id":"1314998881126625280","isRetweet":false,"retweets":58015,"text":"Joe Biden is a PUPPET of CASTRO-CHAVISTAS like Crazy Bernie, AOC and Castro-lover Karen Bass. Biden is supported by socialist Gustavo Petro, a major LOSER and former M-19 guerrilla leader. Biden is weak on socialism and will betray Colombia. I stand with you!"},{"date":1602073093000,"favorites":45234,"id":"1313815894494261251","isRetweet":false,"retweets":10908,"text":"Because I’ve beaten him and his very few remaining clients so much, and so badly, that he has become a blathering idiot. He failed with John McCain and will fail again with all others. He is a total loser. @MarshaBlackburn is a Tennessee Star, a highly respected WINNER! https://t.co/SxUzvwIHxT"},{"date":1601472705000,"favorites":167618,"id":"1311297684540620801","isRetweet":false,"retweets":33546,"text":"Nobody wants Sleepy Joe as a leader, including the Radical Left (which he lost last night!). He disrespected Bernie, effectively calling him a loser!"},{"date":1599741730000,"favorites":49893,"id":"1304037450793115648","isRetweet":false,"retweets":13523,"text":"Now @FoxNews is putting on yet another loser, Jamie Weinstein, into their stable of Trump haters. People who failed for many years are now going on Fox to explain “Trump”. Schumer puppet Chris Hahn and his twin brother, Richard Goodstein, together with cheater Donna Brazil. Bad!"},{"date":1599187018000,"favorites":119572,"id":"1301710819349204992","isRetweet":false,"retweets":23163,"text":"....John a loser and swear on whatever, or whoever, I was asked to swear on, that I never called our great fallen soldiers anything other than HEROES. This is more made up Fake News given by disgusting &amp; jealous failures in a disgraceful attempt to influence the 2020 Election!"},{"date":1599040007000,"favorites":37596,"id":"1301094208967774208","isRetweet":false,"retweets":10119,"text":"See, even a Kennedy isn’t safe in the new Radical Left Democrat Party. Taxes up big, no 2A. Biden has completely lost control. Pelosi strongly backed the loser! https://t.co/DKYVBpbpP7"},{"date":1597754563000,"favorites":65417,"id":"1295702666903945217","isRetweet":false,"retweets":17383,"text":"John Kasich did a bad job in Ohio, ran for President and was easy to beat, and now went to the other side desperate for relevance. Good Job by Chris C in exposing yet another loser! https://t.co/WZw2U7lcrf"},{"date":1597023934000,"favorites":110934,"id":"1292638186842337281","isRetweet":false,"retweets":24779,"text":".@Scaramucci, who just made a fool of himself as he got taken apart by @SteveHiltonx, only lasted 11 days in his favorite of all time Administration, before being fired for, again, making a fool of himself. Anthony is a loser who begged to come back. I said “No Thanks”."},{"date":1592049102000,"favorites":67722,"id":"1271772229936779266","isRetweet":false,"retweets":19848,"text":"Thank you Frank. Fredo’s ratings are really bad, more than 50% down. A loser!!! https://t.co/DGaSYhqJVj"},{"date":1589813714000,"favorites":140525,"id":"1262396333064892416","isRetweet":false,"retweets":33150,"text":"LOSER! https://t.co/p5imhMJqS1"},{"date":1588653994000,"favorites":55705,"id":"1257532112233803782","isRetweet":false,"retweets":12393,"text":"....because they don’t know how to win, and their so-called Lincoln Project is a disgrace to Honest Abe. I don’t know what Kellyanne did to her deranged loser of a husband, Moonface, but it must have been really bad. John Weaver lost big for Kasich (to me). Crazed Rick Wilson...."},{"date":1588653993000,"favorites":32543,"id":"1257532110971318274","isRetweet":false,"retweets":7944,"text":"....get even for all of their many failures. You see, these loser types don’t care about 252 new Federal Judges, 2 great Supreme Court Justices, a rebuilt military, a protected 2nd Amendment, biggest EVER Tax &amp; Regulation cuts, and much more. I didn’t use any of them...."},{"date":1588335276000,"favorites":90560,"id":"1256195312965877760","isRetweet":false,"retweets":21049,"text":"Cryin Chuck Schumer, compared to what other Senators have brought home to their states, has brought very little back to N.Y. A totally overrated loser, the one thing he has given them is SALT. He never even called me to stop it. No wonder Cuomo &amp; most others can’t stand him. AOC!"},{"date":1583292916000,"favorites":169684,"id":"1235046124328755200","isRetweet":false,"retweets":31446,"text":"Elizabeth “Pocahontas” Warren, other than Mini Mike, was the loser of the night. She didn’t even come close to winning her home state of Massachusetts. Well, now she can just sit back with her husband and have a nice cold beer!"},{"date":1583292238000,"favorites":162837,"id":"1235043280846381058","isRetweet":false,"retweets":30852,"text":"The biggest loser tonight, by far, is Mini Mike Bloomberg. His “political” consultants took him for a ride. $700 million washed down the drain, and he got nothing for it but the nickname Mini Mike, and the complete destruction of his reputation. Way to go Mike!"},{"date":1582945218000,"favorites":59228,"id":"1233587771513507840","isRetweet":false,"retweets":13083,"text":"A so-called reporter named @JohnJHarwood, who bombed so badly in the 2016 Presidential Debates that I thought he was going to be immediately fired (a Mini Mike type performance), is now with Fake News @CNN. A total loser!"},{"date":1582901691000,"favorites":93229,"id":"1233405207217876992","isRetweet":false,"retweets":18663,"text":"To the people of South Carolina, Tom Steyer is a joke, laughed at by everyone, a total incompetent. He made money in coal, now he “hates” coal. Did you see him fawning over Crazy Bernie? Has no chance, a loser for South Carolina, doesn’t deserve your vote!"},{"date":1581599589000,"favorites":94700,"id":"1227943796681400320","isRetweet":false,"retweets":22482,"text":"Mini Mike Bloomberg is a LOSER who has money but can’t debate and has zero presence, you will see. He reminds me of a tiny version of Jeb “Low Energy” Bush, but Jeb has more political skill and has treated the Black community much better than Mini! https://t.co/qIef5VhjDr"},{"date":1579699413000,"favorites":34218,"id":"1219973879692713989","isRetweet":false,"retweets":7425,"text":"Steyer is a major loser. Just doesn’t get it. This is second time with Bernie! https://t.co/fxZh8zNhks"},{"date":1576154430000,"favorites":0,"id":"1205105142216974336","isRetweet":true,"retweets":5078,"text":"RT @RepMattGaetz: There are a lot of moderate Dems who recognize what a political loser impeachment is.\n\nThey're encouraging their leadersh…"},{"date":1573651085000,"favorites":59700,"id":"1194605354484715520","isRetweet":false,"retweets":15817,"text":"“Nancy Pelosi cares more about power than she does about principle. She did not want to go down this road. She realizes this is a huge loser for Democrats. The Founders envisioned the worst people being in politics, yet they couldn’t envision this. You have these people taking..."},{"date":1565238003000,"favorites":111272,"id":"1159318329506574336","isRetweet":false,"retweets":19724,"text":"Just watched a world class loser, Tim O’Brien, who I haven’t seen or spoken to in many years, &amp; knows NOTHING about me except that he wrote a failed hit piece book about me 15 years ago. Fired like a dog from other jobs? Saw him on Lyin’ Brian Williams Trump Slam Show. Bad TV...."},{"date":1562245517000,"favorites":116119,"id":"1146766931573301248","isRetweet":false,"retweets":25722,"text":"Great news for the Republican Party as one of the dumbest &amp; most disloyal men in Congress is “quitting” the Party. No Collusion, No Obstruction! Knew he couldn’t get the nomination to run again in the Great State of Michigan. Already being challenged for his seat. A total loser!"},{"date":1562244143000,"favorites":0,"id":"1146761170004713472","isRetweet":true,"retweets":16065,"text":"RT @RealCandaceO: You cannot be a victim and a victor at the same time. \n\nYou can either choose to win or accept your status as a loser.…"},{"date":1560052448000,"favorites":59643,"id":"1137568536690343936","isRetweet":false,"retweets":10528,"text":"....other than to know he was, and is, a total Loser. When he makes statements about me, they are made up, he knows nothing!"},{"date":1559548278000,"favorites":201594,"id":"1135453891326238721","isRetweet":false,"retweets":47335,"text":".@SadiqKhan, who by all accounts has done a terrible job as Mayor of London, has been foolishly “nasty” to the visiting President of the United States, by far the most important ally of the United Kingdom. He is a stone cold loser who should focus on crime in London, not me......"},{"date":1558274107000,"favorites":78231,"id":"1130109633673211906","isRetweet":false,"retweets":17264,"text":"....he would see that it was nevertheless strong on NO COLLUSION and, ultimately, NO OBSTRUCTION...Anyway, how do you Obstruct when there is no crime and, in fact, the crimes were committed by the other side? Justin is a loser who sadly plays right into our opponents hands!"},{"date":1553082700000,"favorites":127551,"id":"1108335293671845888","isRetweet":false,"retweets":26011,"text":"George Conway, often referred to as Mr. Kellyanne Conway by those who know him, is VERY jealous of his wife’s success &amp; angry that I, with her help, didn’t give him the job he so desperately wanted. I barely know him but just take a look, a stone cold LOSER &amp; husband from hell!"},{"date":1552998880000,"favorites":69178,"id":"1107983725034463232","isRetweet":false,"retweets":15861,"text":"A total loser! https://t.co/vm3Vv2f9jf"},{"date":1550592301000,"favorites":116520,"id":"1097889803864064001","isRetweet":false,"retweets":25963,"text":"I never said anything bad about Andrew McCabe’s wife other than she (they) should not have taken large amounts of campaign money from a Crooked Hillary source when Clinton was under investigation by the FBI. I never called his wife a loser to him (another McCabe made up lie)!"},{"date":1534467402000,"favorites":110496,"id":"1030257073047658501","isRetweet":false,"retweets":30040,"text":"How can “Senator” Richard Blumenthal, who went around for twenty years as a Connecticut politician bragging that he was a great Marine war hero in Vietnam (then got caught and sobbingly admitted he was neither a Marine nor ever in Vietnam), pass judgement on anyone? Loser!"},{"date":1534168227000,"favorites":80892,"id":"1029002242932834310","isRetweet":false,"retweets":18386,"text":"...really bad things. Nasty to people &amp; would constantly miss meetings &amp; work. When Gen. Kelly came on board he told me she was a loser &amp; nothing but problems. I told him to try working it out, if possible, because she only said GREAT things about me - until she got fired!"},{"date":1529282524000,"favorites":84263,"id":"1008510118395293699","isRetweet":false,"retweets":21339,"text":"Why was the FBI’s sick loser, Peter Strzok, working on the totally discredited Mueller team of 13 Angry &amp; Conflicted Democrats, when Strzok was giving Crooked Hillary a free pass yet telling his lover, lawyer Lisa Page, that “we’ll stop” Trump from becoming President? Witch Hunt!"},{"date":1524316201000,"favorites":49503,"id":"987679850545778689","isRetweet":false,"retweets":10795,"text":"....non-existent “sources” and a drunk/drugged up loser who hates Michael, a fine person with a wonderful family. Michael is a businessman for his own account/lawyer who I have always liked &amp; respected. Most people will flip if the Government lets them out of trouble, even if...."},{"date":1524313042000,"favorites":10374,"id":"987666601808924672","isRetweet":false,"retweets":2671,"text":"....non-existent “sources” and a drunk/drugged up loser who hates Michael, a fine person with a wonderful family. Michael is a businessman for his own account/lawyer who I have always liked &amp; respected. Most people will flip if the Government lets them out of trouble, even if...."},{"date":1518961599000,"favorites":76885,"id":"965221024496279552","isRetweet":false,"retweets":19637,"text":"The Fake News of big ratings loser CNN. https://t.co/rYsv90cnvs"},{"date":1516111658000,"favorites":100620,"id":"953267506004754432","isRetweet":false,"retweets":24015,"text":"The Democrats want to shut down the Government over Amnesty for all and Border Security. The biggest loser will be our rapidly rebuilding Military, at a time we need it more than ever. We need a merit based system of immigration, and we need it now! No more dangerous Lottery."},{"date":1515213128000,"favorites":88836,"id":"949498795074736129","retweets":23915,"text":"Michael Wolff is a total loser who made up stories in order to sell this really boring and untruthful book. He used Sloppy Steve Bannon, who cried when he got fired and begged for his job. Now Sloppy Steve has been dumped like a dog by almost everyone. Too bad! https://t.co/mEeUhk5ZV9"},{"date":1511011907000,"favorites":191955,"id":"931877599034388480","isRetweet":false,"retweets":51390,"text":"Crooked Hillary Clinton is the worst (and biggest) loser of all time. She just can’t stop, which is so good for the Republican Party. Hillary, get on with your life and give it another try in three years!"},{"date":1510742739000,"favorites":135601,"id":"930748627642998784","isRetweet":false,"retweets":32702,"text":"While in the Philippines I was forced to watch @CNN, which I have not done in months, and again realized how bad, and FAKE, it is. Loser!"},{"date":1505653412000,"favorites":0,"id":"909402439643750400","isRetweet":true,"retweets":21445,"text":"RT @realDonaldTrump: Loser terrorists must be dealt with in a much tougher manner.The internet is their main recruitment tool which we must…"},{"date":1505472498000,"favorites":97462,"id":"908643633901039617","isRetweet":false,"retweets":21411,"text":"Loser terrorists must be dealt with in a much tougher manner.The internet is their main recruitment tool which we must cut off &amp; use better!"},{"date":1505472175000,"favorites":110223,"id":"908642277987356673","isRetweet":false,"retweets":29327,"text":"Another attack in London by a loser terrorist.These are sick and demented people who were in the sights of Scotland Yard. Must be proactive!"},{"date":1464562396000,"favorites":16261,"id":"737054226833149952","isRetweet":false,"retweets":5076,"text":"Bill Kristol has been wrong for 2yrs-an embarrassed loser, but if the GOP can't control their own, then they are not a party. Be tough, R's!"},{"date":1457242837000,"favorites":19409,"id":"706353772751163392","isRetweet":false,"retweets":5472,"text":".@FoxNews is devastated that lightweight Senator Marco Rubio got trounced tonight and is the big loser. I won the two big states, great!"},{"date":1457094552000,"favorites":5944,"id":"705731821489807364","isRetweet":false,"retweets":1630,"text":"\"@SirHatchporch: Mary Kissel is an SNL character, right? She's not a real person, right? #MorningJoe\"  She is a major loser - no clue!"},{"date":1456495349000,"favorites":15440,"id":"703218582310641667","isRetweet":false,"retweets":4815,"text":"Have a good chance to win Texas on Tuesday. Cruz is a nasty guy, not one Senate endorsement and, despite talk, gets nothing done. Loser!"},{"date":1455199989000,"favorites":6845,"id":"697785447771172864","isRetweet":false,"retweets":2062,"text":"There are no buyers for the worthless @NYDailyNews but little Mort Zuckerman is frantically looking. It is bleeding red ink - a total loser!"},{"date":1454724095000,"favorites":4860,"id":"695789403374014464","isRetweet":false,"retweets":1725,"text":"Really dumb @CheriJacobus. Begged my people for a job. Turned her down twice and she went hostile. Major loser, zero credibility!"},{"date":1453214665000,"favorites":4280,"id":"689458393283563524","isRetweet":false,"retweets":1456,"text":"Dope Frank Bruni said I called many people, including Karl Rove, losers-true! I never called my friend @HowardStern a loser- he’s a winner!"},{"date":1451488964000,"favorites":2488,"id":"682220279871979520","isRetweet":false,"retweets":766,"text":"Joe McQuaid (@deucecrew) is desperately trying to sell the @UnionLeader. It's a loser, and my comments haven't helped him much."},{"date":1451219844000,"favorites":2210,"id":"681091509811306496","isRetweet":false,"retweets":929,"text":"\"@Sir_Max: andreajmarkley: Rubio finally gets an endorsement – from #Benghazi loser Gowdy #Tcot #pjnet https://t.co/lJcHG0IHaM via dailyne"},{"date":1450672941000,"favorites":8076,"id":"678797631250911232","isRetweet":false,"retweets":3119,"text":".@JebBush today said he didn't want to be the front-runner, he would rather be where he is now, 2%. That is the talk of a loser, can't win!"},{"date":1449984530000,"favorites":6031,"id":"675910224855855104","isRetweet":false,"retweets":2528,"text":"Something must be done with dopey @KarlRove - he is pushing Republicans down the same old path of defeat. Don't fall for it, Karl is a loser"},{"date":1449714358000,"favorites":4041,"id":"674777043163332608","isRetweet":false,"retweets":1471,"text":"Why does @CNN bore their audience with people like @secupp, a totally biased loser who doesn't have a clue. I hear she will soon be gone!"},{"date":1448458835000,"favorites":1445,"id":"669510996504010752","isRetweet":false,"retweets":681,"text":"@KarlRove just totally bombed on @Morning_Joe. @FoxNews has him on even though he has lost all credibility - a loser!  Fox should dump Rove."},{"date":1447631226000,"favorites":2166,"id":"666039755038150656","isRetweet":false,"retweets":797,"text":"I have watched sloppy Graydon Carter fail and close Spy Magazine and now am watching him fail at @VanityFair Magazine. He is a total loser!"},{"date":1446354959000,"favorites":2361,"id":"660686703359877120","isRetweet":false,"retweets":925,"text":"\"@N_R_Mandela: @realDonaldTrump And you're still a negative loser and Trump is still a positive winner. I'm Black and proudly voting TRUMP!\""},{"date":1438932211000,"favorites":1977,"id":"629553442944602112","isRetweet":false,"retweets":866,"text":"\"@RubenMMoreno: @realDonaldTrump The biggest loser in the debate was @megynkelly. You can't out trump Donald Trump. You will lose!"},{"date":1437255948000,"favorites":905,"id":"622522682245033984","isRetweet":false,"retweets":438,"text":"Via @fitsnews: “Donald Trump: John McCain Is ‘A Loser’” http://t.co/sgiETvdUqi"},{"date":1437058954000,"favorites":845,"id":"621696429749325825","isRetweet":false,"retweets":537,"text":".@KarlRove wasted $400 million + and didn’t win one race—a total loser. @FoxNews"},{"date":1434439805000,"favorites":58,"id":"610710925088301056","isRetweet":false,"retweets":21,"text":"\"@_Snurk: @realDonaldTrump Love it! Always respect FIGHTERS over overrated loser POLITITIANS!! Inspire GREATNESS! #TRUMP #2016\""},{"date":1433477424000,"favorites":45,"id":"606674404723015682","isRetweet":false,"retweets":26,"text":"\"@Bobzilla305: @realDonaldTrump @krauthammer is a progressive making money off of the Conservative viewership\" A total loser!"},{"date":1432187893000,"favorites":12,"id":"601265719007944704","isRetweet":false,"retweets":11,"text":"\"@HarmonBrew: @FoxNews @megynkelly  DonaldTrump #KellyFile Trump is so right about Geller. Megyn, stop advocating for her; its a loser.\""},{"date":1429972842000,"favorites":109,"id":"591975121616777217","isRetweet":false,"retweets":72,"text":".@NRO  Not much is as \"dead\" or irrelevant as National Review thanks to guidance of Goldberg, a total loser! Get some real talent or fold!"},{"date":1423623043000,"favorites":73,"id":"565342137416691713","isRetweet":false,"retweets":23,"text":"\"@VMilaccio: #DonaldTrump was right about #RosieODonnell. She is a no talent loser who deserves her comeuppance. @realDonaldTrump\""},{"date":1422325052000,"favorites":18,"id":"559897966899888128","isRetweet":false,"retweets":7,"text":"\"@Pretty_Nikki21: @realDonaldTrump is trying to set @KenyaMoore up putting her in loser seats #CelebApprentice\""},{"date":1422309129000,"favorites":108,"id":"559831181819392000","isRetweet":false,"retweets":74,"text":"Why do people give @KarlRove contributions when they know he is a loser who has no idea how to win? http://t.co/mbnmf8D8jI"},{"date":1422200924000,"favorites":207,"id":"559377335636746240","isRetweet":false,"retweets":184,"text":"Word is that @NBCNews is firing sleepy eyes Chuck Todd in that his ratings on Meet the Press are setting record lows. He's a real loser!"},{"date":1419938161000,"favorites":64,"id":"549886622943444992","isRetweet":false,"retweets":61,"text":"\"@rinibobusepi: RT @realDonaldTrump “You're never a loser until you quit trying,” - Mike Ditka\""},{"date":1419392856000,"favorites":15,"id":"547599447220572161","isRetweet":false,"retweets":7,"text":"\"@kyleraccio: @realDonaldTrump loser newspaper &amp; loser comedian!\""},{"date":1418090039000,"favorites":890,"id":"542135034984284160","isRetweet":false,"retweets":712,"text":"Sorry, @Rosie is a mentally sick woman, a bully, a dummy and, above all, a loser. Other than that she is just wonderful!"},{"date":1414497614000,"favorites":107,"id":"527067312730693632","isRetweet":false,"retweets":79,"text":"\"@LeRoyal_Pegasus: “Show me someone without an ego, and I'll show you a loser.” ― @realDonaldTrump\""},{"date":1413503542000,"favorites":6872,"id":"522897870891261952","isRetweet":false,"retweets":6967,"text":".@katyperry  Katy, what the hell were you thinking when you married loser Russell Brand. There is a guy who has got nothing going, a waste!"},{"date":1413492624000,"favorites":449,"id":"522852077488185344","isRetweet":false,"retweets":360,"text":"I watched Russell Brand @rustyrockets on the @jimmyfallon show the other night—what the hell do people see in Russell—a major loser!"},{"date":1413389918000,"favorites":34,"id":"522421300124729344","isRetweet":false,"retweets":34,"text":"Lightweight @AGSchneiderman is driving business &amp; jobs out of NY. Only wants self publicity—a total loser!"},{"date":1413199742000,"favorites":100,"id":"521623643257049088","isRetweet":false,"retweets":100,"text":"\"@DRJAMESCABOT: Donald you're so handsome... i can speak... Paltrow loser... Trump 2016 rock n roll back in the OVAL not Paltrow\""},{"date":1412951568000,"favorites":43,"id":"520582724533641216","isRetweet":false,"retweets":16,"text":"Lightweight @AGSchneiderman will probably win only because he is a Dem in NY, but what a loser!"},{"date":1407118969000,"favorites":73,"id":"496119034543636480","isRetweet":false,"retweets":71,"text":".@FrankLuntz works really hard but is a guy who just doesn't have it - a total loser!"},{"date":1404797556000,"favorites":206,"id":"486382318819352577","isRetweet":false,"retweets":217,"text":"\"@FSMalang: \"Show me a man without an ego and I'll show you a loser\" - Donald Trump\""},{"date":1403543801000,"favorites":74,"id":"481123689644457984","isRetweet":false,"retweets":65,"text":"The dying @NYDailyNews asked me to do an Editorial on the Central Park 5 ripoff  &amp; then they pretend it was my idea. Loser newspaper!"},{"date":1403424900000,"favorites":12,"id":"480624986294456321","isRetweet":false,"retweets":9,"text":"\"@jperk1: @realDonaldTrump Goldberger was a loser\"  True, really bad taste - but he's gone now!"},{"date":1403208128000,"favorites":16,"id":"479715774731673600","isRetweet":false,"retweets":16,"text":"PM Sarah Westcot-Williams incompetence should not be rewarded. You should vote for anyone who runs against her—loser! @PrimeMinisterSX"},{"date":1399084424000,"favorites":31,"id":"462419708722290688","isRetweet":false,"retweets":22,"text":"\"@buff1414: @realDonaldTrump @sethmeyers Enough Donnie. Stop busting the guys balls.\"  Why, he's a total loser!"},{"date":1399029345000,"favorites":72,"id":"462188692275490816","isRetweet":false,"retweets":61,"text":"Wow, Vanity Fair was totally shut out at the National Magazine Awards - it got NOTHING. Graydon Carter is a loser with bad food restaurants!"},{"date":1397293563000,"favorites":140,"id":"454908292700315648","isRetweet":false,"retweets":118,"text":"\"@miorazhari: Show me someone without an ego, and I'll show you a loser. (Donald Trump)\""},{"date":1396703004000,"favorites":249,"id":"452431310876065794","isRetweet":false,"retweets":136,"text":"\"@RivalofElmBlock: @TMZ mark cuban is a nut. way less powerful than Donald Trump\"  I agree - also, in many ways, a total loser!"},{"date":1394052009000,"favorites":550,"id":"441312228608704512","isRetweet":false,"retweets":779,"text":"\"You're never a loser until you quit trying.\" -- Mike Ditka"},{"date":1393512202000,"favorites":121,"id":"439048116407635968","isRetweet":false,"retweets":143,"text":"Lightweight @AGSchneiderman’s phony lawsuit against Trump U was decimated by the court—he’s a loser!"},{"date":1390253323000,"favorites":605,"id":"425379385714024448","isRetweet":false,"retweets":940,"text":"“You're never a loser until you quit trying.” - Mike Ditka"},{"date":1389905368000,"favorites":19,"id":"423919957089349633","isRetweet":false,"retweets":12,"text":"Lightweight @AGSchneiderman is fighting with @NYGovCuomo –Cuomo wins that one easily. Schneiderman is a total loser."},{"date":1386489687000,"favorites":1409,"id":"409593552314712064","isRetweet":false,"retweets":1485,"text":"Show me someone without an ego, and I'll show you a loser - having a healthy ego, or high opinion of yourself, is a real positive in life!"},{"date":1383166828000,"favorites":436,"id":"395656470110273536","isRetweet":false,"retweets":784,"text":"“You're never a loser until you quit trying.” - Mike Ditka"},{"date":1383062763000,"favorites":20,"id":"395219992125243392","isRetweet":false,"retweets":40,"text":".@AlexSalmond suffered a huge defeat by the people of Blackdog. Communities all over Scotland are fighting this loser."},{"date":1380828948000,"favorites":1,"id":"385850690632818688","isRetweet":false,"retweets":7,"text":"@TheTinaBeast’s continued incompetence has led to more people losing their jobs http://t.co/W6d60Oiecc She's a perpetual job loser."},{"date":1378353003000,"favorites":31,"id":"375465828265000960","isRetweet":false,"retweets":27,"text":"\"@REAPEROFTRUTH: @realDonaldTrump u mad because @jayleno doesn't want u on his show? He begs me to go on his show-done it many times loser!"},{"date":1376419393000,"favorites":6,"id":"367355679394115585","isRetweet":false,"retweets":23,"text":"The Patch, a total loser for @AOL, will be a good deal compared to @HuffingtonPost. @ariannahuff laughs at “stupid” Armstrong!"},{"date":1376385537000,"favorites":688,"id":"367213676459479040","isRetweet":false,"retweets":540,"text":"\"@pencey_mouth: remember when donald trump blocked me. i'm proud of myself\"  NO, YOU'RE A LOSER!"},{"date":1373756360000,"favorites":165,"id":"356186107660083201","isRetweet":false,"retweets":152,"text":"\"@PhilipinDC: I've finally unfollowed @realDonaldTrump\"  I doubt it loser but, if so, you'll be back because you're lonely &amp; admire genius!"},{"date":1373074570000,"favorites":10,"id":"353326474817839104","isRetweet":false,"retweets":12,"text":"\"@GZervs: @realDonaldTrump why would Howard ever want to play for the loser owner Cuban ?\"  I guess he didn't!"},{"date":1373073313000,"favorites":30,"id":"353321201768202241","isRetweet":false,"retweets":40,"text":"\"@stevemit30: @realDonaldTrump everyone knew he was going to Houston - Bullshit loser, most thought Lakers or Dallas!"},{"date":1372949131000,"favorites":40,"id":"352800343547052034","isRetweet":false,"retweets":49,"text":"\"@Numerologynow: @realDonaldTrump U R RICH because your #DADDY left U with 400 Million. I only wish my daddy left me 400M loser-Now over 10B"},{"date":1372553689000,"favorites":861,"id":"351141738766807040","isRetweet":false,"retweets":795,"text":"Everytime someone tweets that I wear a wig realize to yourself that you are dealing with \"them\" - just another sad &amp; lonely hater and loser!"},{"date":1371749108000,"favorites":35,"id":"347767082064158720","isRetweet":false,"retweets":15,"text":"@DannyZuker Loser Danny is obsessed with Trump."},{"date":1371086817000,"favorites":7,"id":"344989234916114434","isRetweet":false,"retweets":16,"text":"\"@Tigergal62: Not very presidential: @realDonaldTrump: .@DannyZuker Danny--You're a total loser!\"  Perhaps, but 100% true!"},{"date":1371065174000,"favorites":196,"id":"344898458169257984","isRetweet":false,"retweets":148,"text":".@DannyZuker  Danny--You're a total loser!"},{"date":1369698483000,"favorites":122,"id":"339166139143827456","isRetweet":false,"retweets":101,"text":"\"@Ghetto_Trophy: @realDonaldTrump how are you a billionaire?\"  You mean ten times over hater (loser)."},{"date":1369521387000,"favorites":20,"id":"338423344095440896","isRetweet":false,"retweets":16,"text":"\"@MikeMcCabeSad: @realDonaldTrump @DannyZuker the fact that you keep tweeting at him is showing why you lost\"  True, Danny is a known loser!"},{"date":1369519858000,"favorites":9,"id":"338416929679241217","isRetweet":false,"retweets":4,"text":"\"@RealSonnyNewman: @realDonaldTrump wins @DannyZuker is afraid of you and knows he is a pathetic loser. Mr. Trump, you are a role model."},{"date":1369515414000,"favorites":21,"id":"338398290490040320","isRetweet":false,"retweets":13,"text":"\"@DannyZuker: .@realDonaldTrump I'll never respond to your asinine bet. You're gutless Danny, and you don't even know what the bet is-loser!"},{"date":1369351450000,"favorites":41,"id":"337710578002980865","isRetweet":false,"retweets":65,"text":"I loved beating these two terrible human beings. I would never recommend that anyone use her lawyer, he is a total loser!"},{"date":1369270186000,"favorites":5,"id":"337369728840515585","isRetweet":false,"retweets":3,"text":"@markwonderful   Sorry, Graydon Carter is a major loser, just ask his wife!"},{"date":1368308181000,"favorites":141,"id":"333334790180855808","isRetweet":false,"retweets":145,"text":"\"@theRealRyanMatt: @realDonaldTrump i never seen apprentice or shark tank am i a fat loser?\"  No, just a loser!"},{"date":1367983469000,"favorites":8,"id":"331972846509244416","isRetweet":false,"retweets":5,"text":"\"@gdelag: @realDonaldTrump @rodmonium91 Just ck how many followers have each follower.  But I notice you follow loser-boredom without Trump!"},{"date":1367289767000,"favorites":135,"id":"329063251222618112","isRetweet":false,"retweets":103,"text":"@DannyZuker  Night loser!"},{"date":1367288416000,"favorites":11,"id":"329057584847925248","isRetweet":false,"retweets":14,"text":"\"@PureManhattan: @DannyZuker @realDonaldTrump Id rather support The Don than some clown. Just saying. Danny, you are a clown.Yes and loser!"},{"date":1367286838000,"favorites":35,"id":"329050965028241409","isRetweet":false,"retweets":12,"text":"\"@jtan_from_ott: @realDonaldTrump would ever have a loser like @dannyzuker on the apprentice? His stupidity could be funny. Interesting!"},{"date":1367280712000,"favorites":15,"id":"329025271346909184","isRetweet":false,"retweets":19,"text":"\"@PyperProblems: @realDonaldTrump someone needs to fire @DannyZuker !\"  He will fire himself-a total loser!"},{"date":1367263933000,"favorites":80,"id":"328954894176366594","isRetweet":false,"retweets":60,"text":"“Failed show @DannyZuker” I have never heard of you and was told you are a loser-after reading your credits I have no questions about it!"},{"date":1367033092000,"favorites":47,"id":"327986677383561218","isRetweet":false,"retweets":27,"text":"\"@jTheCollegeKid: @realDonaldTrump @joooooojaah Shut up Trump I'm unfollowing you\"  Great, but you won't stop loser-you have no control!"},{"date":1366895513000,"favorites":21,"id":"327409630974205952","isRetweet":false,"retweets":17,"text":"\"@DaveCentrist: @realDonaldTrump The most over-rated person on the planet, Donald J. Trump. Except by himself. Why do you follow loser?"},{"date":1365332188000,"favorites":18,"id":"320852568920166401","isRetweet":false,"retweets":32,"text":"\"@ec364: @realDonaldTrump where's Sadam's billiions of $$ after Bush invested American taxpayer$. We were too stupid to take it-loser pols!"},{"date":1365168123000,"favorites":95,"id":"320164430530887680","isRetweet":false,"retweets":125,"text":"\"@rodmonium91: @realDonaldTrump Will the Mavs make the playoffs, what do u think Mr Trump?\" No, Mark Cuban is a loser!"},{"date":1363974649000,"favorites":61,"id":"315158640199872514","isRetweet":false,"retweets":100,"text":".@MichelleMalkin would be nothing without being on the @seanhannity show.  I don’t see what Sean sees in her—loser!"},{"date":1363716794000,"favorites":40,"id":"314077115408580608","isRetweet":false,"retweets":46,"text":"Why do shows have @ananavarro—Ntl Hispanic Chair for the losing McCain ’08 &amp; Huntsman ’12.  She’s a loser who doesn’t deliver votes."},{"date":1363691268000,"favorites":1482,"id":"313970051453710336","isRetweet":false,"retweets":1410,"text":"Golf match? I've won 18 Club Championships including this weekend. @mcuban swings like a little girl with no power or talent. Mark's a loser"},{"date":1363641822000,"favorites":8,"id":"313762661303189504","isRetweet":false,"retweets":16,"text":"\"@salesdan48: @realDonaldTrump Mark will go down in history as a clownish buffoon. Mark my words.\" I agree with you-and a loser!"},{"date":1363638852000,"favorites":11,"id":"313750202450329600","isRetweet":false,"retweets":15,"text":"Great article by @jameshohmann @politico explaining why @KarlRove was biggest loser @CPACnews http://t.co/QHnym5AjPG James is sharp."},{"date":1362280837000,"favorites":15,"id":"308054274754093057","isRetweet":false,"retweets":18,"text":"\"@SPORTSGURU77: @realDonaldTrump who's Chris Jackson?\" A total loser but a loyal follower!"},{"date":1361417297000,"favorites":11,"id":"304432326266454017","isRetweet":false,"retweets":19,"text":"@Yolie4MS. Loser!"},{"date":1361396085000,"favorites":1,"id":"304343358288039936","isRetweet":false,"retweets":1,"text":"@mldemmons.  Go Angelo failed and gave up - now wants more p.r.  - loser!"},{"date":1360609632000,"favorites":31,"id":"301044733751488512","isRetweet":false,"retweets":76,"text":"“Donald Trump: ‘Karl Rove Is A Total Loser,’ So Why Are People Still Giving Him Money?”  http://t.co/q2RldzhB via @Mediaite"},{"date":1360605050000,"favorites":1645,"id":"301025514901094400","isRetweet":false,"retweets":1571,"text":"I don’t like bullies.  I am not going to stand around and watch @KarlRove target the Tea Party.  Karl Rove gave us Barack Obama. Loser."},{"date":1360328673000,"favorites":95,"id":"299866309024440321","isRetweet":false,"retweets":131,"text":"@karlrove is a total loser...save your money!"},{"date":1360259370000,"favorites":206,"id":"299575627449761793","isRetweet":false,"retweets":406,"text":"Karl Rove is a total loser. Money given to him might as well be thrown down the drain."},{"date":1358867363000,"favorites":5,"id":"293737127529816064","isRetweet":false,"retweets":8,"text":"@CoCo471031 You really sound like a loser no-name!"},{"date":1356101167000,"favorites":6,"id":"282134861349806080","isRetweet":false,"retweets":9,"text":"@Nc777ww  He is a loser who will self-destruct,  just like @Rosie!"},{"date":1355948358000,"favorites":30,"id":"281493931538124801","isRetweet":false,"retweets":49,"text":"Dummy Graydon Carter doesn't like me too much...great news. He is a real loser! @VanityFair"},{"date":1355162727000,"favorites":136,"id":"278198760251727873","isRetweet":false,"retweets":222,"text":"Dopey Sugar @Lord_Sugar—you are the worst kind of loser—a total fool."},{"date":1354899731000,"favorites":81,"id":"277095675836104704","isRetweet":false,"retweets":209,"text":".@Lord_Sugar....but you wouldn’t notice because you have no vision and you are a total loser."},{"date":1354813268000,"favorites":0,"id":"276733023859396608","isRetweet":false,"retweets":1,"text":"@colonopenbrakit  He is a loser--Andy Murray is a winner!"},{"date":1354812531000,"favorites":18,"id":"276729930073640960","isRetweet":false,"retweets":91,"text":"Scots should boycott Glenfiddich garbage for not choosing great Olympic &amp; U.S. Open champ Andy Murray over total loser Michael Forbes."},{"date":1354746261000,"favorites":22,"id":"276451975980257281","isRetweet":false,"retweets":126,"text":"@KarlRove is such an embarrassment that @FoxNews is keeping him off air http://t.co/amke76xg Rove should be out of politics. A total loser!"},{"date":1354730411000,"favorites":5,"id":"276385492755415040","isRetweet":false,"retweets":9,"text":"@Beardymilne @wtfagain I know you are jealous of Forbes &amp; a total loser."},{"date":1354728116000,"favorites":20,"id":"276375870296440833","isRetweet":false,"retweets":70,"text":"Glenfiddich is a joke—should have chosen Andy Murray—U.S. Open &amp; Olympic gold winner—as Top Scot instead of a total loser!"},{"date":1354638322000,"favorites":15,"id":"275999246333915136","isRetweet":false,"retweets":42,"text":"Michael Forbes is a loser who failed to stop what was just named “the golf course of the year” and which has brought ..."},{"date":1353439791000,"favorites":197,"id":"270972240290516993","isRetweet":false,"retweets":249,"text":"I was nice to loser @rosie and she attacked me--it just shows never let up with a bully. They only fade when you hit them hard!"},{"date":1352237078000,"favorites":105,"id":"265927697631420416","isRetweet":false,"retweets":188,"text":".@MRbelzer is a stone cold loser with no talent--why did they ever put him on \"Law and Order?\""},{"date":1351263911000,"favorites":13,"id":"261845939172540416","isRetweet":false,"retweets":25,"text":"...a real loser named Tim O'Brien--and it's never recovered."},{"date":1345139507000,"favorites":156,"id":"236158329372680193","isRetweet":false,"retweets":268,"text":"The Huffington Post is such a loser--it will die just as AOL is dying, What a stupid deal AOL made to buy it!"},{"date":1345055613000,"favorites":138,"id":"235806450952323072","isRetweet":false,"retweets":212,"text":"Lightweight reporter Alex Pareene @pareene is known as a total joke in political circles. Hence, he writes for Loser Salon. @Salon"},{"date":1342705596000,"favorites":413,"id":"225949765324636160","isRetweet":false,"retweets":1708,"text":"\"Show me someone without an ego, and I'll show you a loser.\" --How To Get Rich"},{"date":1336662623000,"favorites":465,"id":"200603697435246592","isRetweet":false,"retweets":715,"text":".@Cher attacked @MittRomney. She is an average talent who is out of touch with reality. Like @Rosie O'Donnell, a total loser!"},{"date":1331053671000,"favorites":9,"id":"177078050750599168","isRetweet":false,"retweets":32,"text":"My @SquawkCNBC interview discussing why @MittRomney is a great nominee, gas prices and why George Will is a loser. http://t.co/O1bZO2yO"},{"date":1323881155000,"favorites":463,"id":"146994336670822400","isRetweet":false,"retweets":667,"text":"I feel sorry for Rosie 's new partner in love whose parents are devastated at the thought of their daughter being with @Rosie--a true loser."}]
